const HomeConstant = {}

HomeConstant.HEADER_CONTEXT = {
  INFO_DATA: {
    title: '阿米娅',
    subTitle1: 'AMIYA',
    subTitle2: 'CV:黑泽明世',
    detail: '罗德岛的公开领袖，在内部拥有最高执行权。虽然，从外表上看起来仅仅是个不成熟的少女，实际上，她却是深受大家信任的合格的领袖。现在，阿米娅正带领着罗德岛，为了感染者的未来，为了让这片大地挣脱矿石病的阴霾而不懈努力。'
  }
}

HomeConstant.MIDDLE_INFO_CATD = {
  CARD1: { title: '源石', subTitle: 'ORIGINIUMS', detail: '大地被起因不明的天灾四处肆虐，经由天灾席卷过的土地上出现了大量的神秘矿物——“源石”。依赖于技术的进步，源石蕴含的能量投入工业后使得文明顺利迈入现代，与此同时，源石本身也催生出“感染者”的存在。' },
  CARD2: { title: '整合运动', subTitle: 'REUNION', detail: '无种族立场，极端排外的感染者组织。他们宣称“感染者应对自己的身份感到骄傲，积极去获取并使用属于自己的力量”。试图用最原始的手段去争夺世界的公正。以某座被摧毁的伟大城市为开端，医疗机构“罗德岛”的突然介入，令整个事态向着未知发展。' },
  CARD3: { title: '移动城邦', subTitle: 'NOMADIC CITY', detail: '建造在可移动设备上的城市。频繁发生且破坏力巨大的天灾，迫使几乎所有的国家，都需要采用定期迁移家园与聚落的方式进行躲避。而移动城市，正是在这种需求下慢慢诞生的。人们在迁徙的过程中，尝试将建筑和种种装置安设在移动设备之上，并不断地扩大载具的规模。在文明与技术的演变之下，人们最终创造出了十分庞大的移动城市' },
}

export default HomeConstant
